In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [5]:
query = '''
SELECT latitude, longitude
FROM scooters
LIMIT 5;
'''

In [6]:
lat = pd.read_sql(query, con = engine)
lat.head()

    latitude  longitude
0  36.136822 -86.799877
1  36.191252 -86.772945
2  36.144752 -86.806293
3  36.162056 -86.774688
4  36.150973 -86.783109

In [7]:
query = '''
SELECT COUNT(pubdatetime)
FROM scooters
WHERE pubdatetime IS NULL
'''

In [8]:
pubdatetime_null = pd.read_sql(query, con = engine)
pubdatetime_null.head()

   count
0      0

In [9]:
query= '''
SELECT SUM(CASE WHEN chargelevel is null THEN 1 ELSE 0 END) 
AS charge_nulls 
FROM scooters
'''

In [10]:
pubdatetime_null2 = pd.read_sql(query, con = engine)
pubdatetime_null2.head()

   charge_nulls
0           770

In [11]:
query= '''
SELECT SUM(CASE WHEN costpermin is null THEN 1 ELSE 0 END) 
AS costpermin_nulls 
FROM scooters
'''

In [12]:
nulls = pd.read_sql(query, con = engine)
nulls.head()

   costpermin_nulls
0                 0

In [13]:
query= '''
SELECT SUM(CASE WHEN companyname is null THEN 1 ELSE 0 END) 
AS company_nulls 
FROM scooters
'''

In [14]:
nulls2 = pd.read_sql(query, con = engine)
nulls2.head()

   company_nulls
0              0

In [17]:
query= '''
SELECT SUM(CASE WHEN pubtimestamp is null THEN 1 ELSE 0 END) 
AS pub_nulls 
FROM trips
'''

In [18]:
nulls3 = pd.read_sql(query, con = engine)
nulls3.head()

   pub_nulls
0          0

In [19]:
query= '''
SELECT SUM(CASE WHEN companyname is null THEN 1 ELSE 0 END) 
AS company_trips_nulls 
FROM trips
'''

In [20]:
nulls4 = pd.read_sql(query, con = engine)
nulls4.head()

   company_trips_nulls
0                    0

In [21]:
query= '''
SELECT SUM(CASE WHEN triprecordnum is null THEN 1 ELSE 0 END) 
AS trip_nulls 
FROM trips
'''

In [22]:
nulls5 = pd.read_sql(query, con = engine)
nulls5.head()

   trip_nulls
0           0

In [23]:
query= '''
SELECT SUM(CASE WHEN starttime is null THEN 1 ELSE 0 END) 
AS start_nulls 
FROM trips
'''

In [24]:
nulls6 = pd.read_sql(query, con = engine)
nulls6.head()

   start_nulls
0            0

In [25]:
query= '''
SELECT SUM(CASE WHEN startdate is null THEN 1 ELSE 0 END) 
AS start_nulls 
FROM trips
'''

In [26]:
nulls7 = pd.read_sql(query, con = engine)
nulls7.head()

   start_nulls
0            0

In [29]:
query = '''
SELECT min(pubdatetime)
FROM scooters
LIMIT 1
'''

In [30]:
min_date = pd.read_sql(query, con = engine)
min_date.head()

                      min
0 2019-05-01 00:01:41.247

In [31]:
query = '''
SELECT max(pubdatetime)
FROM scooters
LIMIT 1
'''

In [32]:
max_date = pd.read_sql(query, con = engine)
max_date.head()

                  max
0 2019-07-31 23:59:57

In [33]:
query = '''
SELECT min(pubtimestamp)
FROM trips
LIMIT 1
'''

In [34]:
min_date_trips = pd.read_sql(query, con = engine)
min_date_trips.head()

                      min
0 2019-05-01 00:00:55.423

In [35]:
query = '''
SELECT max(pubtimestamp)
FROM trips
LIMIT 1
'''

In [36]:
max_date_trips = pd.read_sql(query, con = engine)
max_date_trips.head()

                  max
0 2019-08-01 07:04:00

In [37]:
query = '''
SELECT DISTINCT(sumdgroup)
FROM scooters
'''

In [39]:
sumdgroup = pd.read_sql(query, con = engine)
sumdgroup.head()

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [40]:
query = '''
SELECT min(latitude)
FROM scooters
LIMIT 1
'''

In [41]:
min_lat = pd.read_sql(query, con = engine)
min_lat.head()

   min
0  0.0

In [44]:
query = '''
SELECT min(longitude)
FROM scooters
LIMIT 1
'''

In [45]:
min_long = pd.read_sql(query, con = engine)
min_long.head()

         min
0 -97.443879

In [46]:
query = '''
SELECT max(latitude)
FROM scooters
LIMIT 1
'''

In [47]:
max_lat = pd.read_sql(query, con = engine)
max_lat.head()

            max
0  3.609874e+06

In [48]:
query = '''
SELECT max(longitude)
FROM scooters
LIMIT 1
'''

In [49]:
max_long = pd.read_sql(query, con = engine)
max_long.head()

   max
0  0.0

In [52]:
query = '''
SELECT max(tripdistance) - min(tripdistance)
FROM trips
LIMIT 1
'''

In [53]:
trip_distance = pd.read_sql(query, con = engine)
trip_distance.head()

       ?column?
0  5.220929e+07